## 타이타닉 데이터셋으로 전처리 연습

In [3]:
import numpy as np
import pandas as pd

In [4]:
train = pd.read_csv('https://bit.ly/fc-ml-titanic')

In [7]:
# csv파일에서 불러온 데이터셋의 가장 앞의 5개 데이터를 보여준다.
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

* PassengerId : 승객 탑승 아이디
* Survived : 생존여부, 1:생존, 0: 사망
* Pclass : 선실의 등급
* Name : 이름
* Sex : 성별
* Age : 나이
* SibSp : 형제, 자매, 배우자 수
* Parch : 부모, 자식 수
* Ticket : 티켓 번호
* Fare : 요금
* Cabin : 좌석번호
* Embarked : 탑승 항구

### 전처리 : train/validation 데이터셋 나누기
  
1. feature와 label을 정의  
2. feature/label을 적절한 비율로 나눈다.

In [9]:
# 전체 데이터중 학습에 사용할 데이터를 선택
feature = [ 'Pclass', 'Sex', 'Age', 'Fare']

# 정답값 혹은 예측갑과 비교할 값
label = ['Survived']

In [10]:
# feature를 정의하고 train[feature]를 지정해주면 
# 리스트안에 선택된 항목만 가져온다.
train[feature].head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [11]:
train[label].head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [12]:
# train의 데이터 특성을 확인해보자
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [15]:
from sklearn.model_selection import train_test_split

x_train, x_valid, y_train, y_valid = train_test_split(train[feature], train[label], test_size=0.2, random_state=123)

In [16]:
print(x_train.shape)
print(y_train.shape)
print(x_valid.shape)
print(y_valid.shape)

(712, 4)
(712, 1)
(179, 4)
(179, 1)

## 전처리(Preprocess) : 결측치를 처리

In [17]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [18]:
# pandas의 isnull()메서드를 사용하여 
# 결측치의 전체 갯수를 확인
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [19]:
train['Age'].isnull().sum()

177

### 수치형 결측치 데이터에 대한 처리

수치형 데이터의 결측치는 대체로 평균값을 구한뒤, 평균값으로 채워준다.

In [20]:
# 0 으로 채웠을때
# describe() 통계치 데이터를 보여준다.
train['Age'].fillna(0).describe()

count    891.000000
mean      23.799293
std       17.596074
min        0.000000
25%        6.000000
50%       24.000000
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [21]:
# 평균값 으로 채웠을때
# describe() 통계치 데이터를 보여준다.
meanAge = train['Age'].mean()
print(meanAge)
train['Age'].fillna(meanAge).describe()

29.69911764705882

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [22]:
# 평균값 으로 채웠을때
# describe() 통계치 데이터를 보여준다.
train['Age'].fillna(train['Age'].mean()).describe()

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age, dtype: float64

#### scikit-learn 에서 imputer메서드를 활용하면 
#### 2개 이상의 컬럼을 한 번에 처리할 수 있다.

In [26]:
from sklearn.impute import SimpleImputer

# imputer 모델선언
imputer = SimpleImputer(strategy='mean')

In [27]:
# fit()
imputer.fit(train[['Age', 'Pclass']])

SimpleImputer()

In [30]:
# transform() 
result = imputer.transform(train[['Age', 'Pclass']])

In [29]:
result

array([[22.        ,  3.        ],
       [38.        ,  1.        ],
       [26.        ,  3.        ],
       ...,
       [29.69911765,  3.        ],
       [26.        ,  1.        ],
       [32.        ,  3.        ]])

In [31]:
train[['Age', 'Pclass']] = result

In [32]:
train[['Age', 'Pclass']].isnull().sum()

Age       0
Pclass    0
dtype: int64

In [34]:
train[['Age', 'Pclass']].describe()

              Age      Pclass
count  891.000000  891.000000
mean    29.699118    2.308642
std     13.002015    0.836071
min      0.420000    1.000000
25%     22.000000    2.000000
50%     29.699118    3.000000
75%     35.000000    3.000000
max     80.000000    3.000000

In [35]:
# 결측치가 있던 원본데이터로 다시 복귀
train = pd.read_csv('https://bit.ly/fc-ml-titanic')

In [36]:
train[['Age','Pclass']].isnull().sum()

Age       177
Pclass      0
dtype: int64

In [37]:
# imputer model정의
imputer = SimpleImputer(strategy='mean')

In [38]:
# fit() + transform() => fit_transform()
result = imputer.fit_transform(train[['Age','Pclass']])

In [39]:
train[['Age', 'Pclass']] = result

In [40]:
train[['Age', 'Pclass']].isnull().sum()

Age       0
Pclass    0
dtype: int64

In [41]:
train[['Age', 'Pclass']].describe()

              Age      Pclass
count  891.000000  891.000000
mean    29.699118    2.308642
std     13.002015    0.836071
min      0.420000    1.000000
25%     22.000000    2.000000
50%     29.699118    3.000000
75%     35.000000    3.000000
max     80.000000    3.000000